{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "c9fa05b6",
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "import emblaze\n",
    "import numpy as np\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "a81d6167",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.0.3\n"
     ]
    }
   ],
   "source": [
    "gds = GraphDataScience(\"bolt://localhost:11003\", auth=(\"neo4j\", \"1234567890\"), database=\"neo4j\")\n",
    "print(gds.version())\n",
    "assert gds.version()\n",
    "using_enterprise = gds.is_licensed()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "4fc08cb4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds.run_cypher(\"\"\"\n",
    "match (:Airport)-[r:HAS_ROUTE]->(:Airport)\n",
    "with collect(r) as routes, max(r.distance) as maxDistance\n",
    "foreach(route in routes | set route.weight = maxDistance + 1 - route.distance)\n",
    "\"\"\")\n",
    "gds.run_cypher(\"\"\"\n",
    "match (n:Airport)\n",
    "with collect(n) as airports\n",
    "foreach(airport in airports | set airport.longitude = airport.location.x)\n",
    "\"\"\")\n",
    "gds.run_cypher(\"\"\"\n",
    "match (n:Airport)\n",
    "with collect(n) as airports\n",
    "foreach(airport in airports | set airport.latitude = airport.location.y)\n",
    "\"\"\")\n",
    "gds.run_cypher(\"\"\"\n",
    "match (p:Airport)-[r:HAS_ROUTE]->(q:Airport)\n",
    "SET r.avgPageRank = p.pagerank + q.pagerank\n",
    "\"\"\")\n",
    "gds.run_cypher(\"\"\"\n",
    "match (:Airport)-[r:HAS_ROUTE]->(:Airport)\n",
    "with collect(r) as routes, max(r.avgPageRank) as maxRank\n",
    "foreach(route in routes | set route.weightedRank = maxRank + 1 - route.avgPageRank)\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "a46bf9ab",
   "metadata": {},
   "outputs": [],
   "source": [
    "G_routes, result = gds.graph.project(\n",
    "   \"air-routes\", \n",
    "   \"Airport\",                                   \n",
    "   {\"HAS_ROUTE\":\n",
    "      {\"orientation\":\"UNDIRECTED\", \n",
    "      \"aggregation\":\"MAX\"}\n",
    "   }, \n",
    "   relationshipProperties = [\"weight\", \"distance\", \"weightedRank\"],\n",
    "    nodeProperties = [\"latitude\", \"longitude\"]\n",
    ")\n",
    "\n",
    "routes_wcc = gds.wcc.stats(G_routes)\n",
    "routes_wcc['componentDistribution']\n",
    "\n",
    "gds.wcc.mutate(G_routes, mutateProperty = 'componentId')\n",
    "\n",
    "gds.graph.writeNodeProperties(G_routes, ['componentId'])\n",
    "\n",
    "gds.run_cypher(\"MATCH (a:Airport) RETURN a.componentId as componentId, count(*) as nodeCount ORDER BY count(*) DESC limit 1\")\n",
    "\n",
    "G_connected_airports, result = gds.beta.graph.project.subgraph(\"connected-airports\", G_routes, \"n.componentId = 0\", \"*\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "131c2058-9d9d-498d-8230-f5f71c9c6cbf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'p99': 1,\n",
       " 'min': 1,\n",
       " 'max': 3292,\n",
       " 'mean': 16.52358490566038,\n",
       " 'p90': 1,\n",
       " 'p50': 1,\n",
       " 'p999': 3292,\n",
       " 'p95': 1,\n",
       " 'p75': 1}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "routes_wcc['componentDistribution']\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "a36470b7",
   "metadata": {},
   "outputs": [],
   "source": [
    "def train_fast_rp(graph, config):\n",
    "    result = gds.fastRP.mutate(\n",
    "        graph,\n",
    "        embeddingDimension = 64,\n",
    "        randomSeed = 45,\n",
    "        **config\n",
    "    )\n",
    "    return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "22362ff1-913c-4347-b544-7e260d6a2d4a",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "a6682c97",
   "metadata": {},
   "outputs": [],
   "source": [
    "configs = [{\"iterationWeights\": [1.0, 1.0], \n",
    "            \"mutateProperty\": \"shallowUnweighted\"},\n",
    "           {\"iterationWeights\": [0.0, 1.0, 1.0], \n",
    "            \"mutateProperty\": \"mediumUnweighted\"},\n",
    "           {\"iterationWeights\": [1.0, 1.0, 1.0, 1.0], \n",
    "            \"mutateProperty\": \"deepUnweighted\"},\n",
    "           {\"iterationWeights\": [1.0, 1.0], \n",
    "            \"relationshipWeightProperty\": \"weight\", \n",
    "            \"mutateProperty\": \"shallowWeighted\"},\n",
    "           {\"iterationWeights\": [0.0, 1.0, 1.0], \n",
    "            \"relationshipWeightProperty\": \"weight\", \n",
    "            \"mutateProperty\": \"mediumWeighted\"},\n",
    "           {\"iterationWeights\": [1.0, 1.0, 1.0, 1.0], \n",
    "            \"relationshipWeightProperty\": \"weight\", \n",
    "            \"mutateProperty\": \"deepWeighted\"}]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "0cf83ed7",
   "metadata": {},
   "outputs": [],
   "source": [
    "embedding_results = [train_fast_rp(G_connected_airports, config) for config in configs]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "67f74064",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodePropertiesWritten</th>\n",
       "      <th>mutateMillis</th>\n",
       "      <th>nodeCount</th>\n",
       "      <th>preProcessingMillis</th>\n",
       "      <th>computeMillis</th>\n",
       "      <th>configuration</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3292</td>\n",
       "      <td>0</td>\n",
       "      <td>3292</td>\n",
       "      <td>1</td>\n",
       "      <td>47</td>\n",
       "      <td>{'nodeSelfInfluence': 0, 'relationshipWeightPr...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3292</td>\n",
       "      <td>0</td>\n",
       "      <td>3292</td>\n",
       "      <td>0</td>\n",
       "      <td>19</td>\n",
       "      <td>{'nodeSelfInfluence': 0, 'relationshipWeightPr...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3292</td>\n",
       "      <td>0</td>\n",
       "      <td>3292</td>\n",
       "      <td>0</td>\n",
       "      <td>21</td>\n",
       "      <td>{'nodeSelfInfluence': 0, 'relationshipWeightPr...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3292</td>\n",
       "      <td>0</td>\n",
       "      <td>3292</td>\n",
       "      <td>1</td>\n",
       "      <td>30</td>\n",
       "      <td>{'nodeSelfInfluence': 0, 'relationshipWeightPr...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3292</td>\n",
       "      <td>0</td>\n",
       "      <td>3292</td>\n",
       "      <td>0</td>\n",
       "      <td>23</td>\n",
       "      <td>{'nodeSelfInfluence': 0, 'relationshipWeightPr...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3292</td>\n",
       "      <td>0</td>\n",
       "      <td>3292</td>\n",
       "      <td>0</td>\n",
       "      <td>29</td>\n",
       "      <td>{'nodeSelfInfluence': 0, 'relationshipWeightPr...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   nodePropertiesWritten  mutateMillis  nodeCount  preProcessingMillis  \\\n",
       "0                   3292             0       3292                    1   \n",
       "0                   3292             0       3292                    0   \n",
       "0                   3292             0       3292                    0   \n",
       "0                   3292             0       3292                    1   \n",
       "0                   3292             0       3292                    0   \n",
       "0                   3292             0       3292                    0   \n",
       "\n",
       "   computeMillis                                      configuration  \n",
       "0             47  {'nodeSelfInfluence': 0, 'relationshipWeightPr...  \n",
       "0             19  {'nodeSelfInfluence': 0, 'relationshipWeightPr...  \n",
       "0             21  {'nodeSelfInfluence': 0, 'relationshipWeightPr...  \n",
       "0             30  {'nodeSelfInfluence': 0, 'relationshipWeightPr...  \n",
       "0             23  {'nodeSelfInfluence': 0, 'relationshipWeightPr...  \n",
       "0             29  {'nodeSelfInfluence': 0, 'relationshipWeightPr...  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame(embedding_results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "8da39f83",
   "metadata": {},
   "outputs": [],
   "source": [
    "embedding_df = gds.run_cypher(\"\"\"\n",
    "    call gds.graph.streamNodeProperties(\"connected-airports\", \n",
    "        [\"shallowUnweighted\", \n",
    "         \"mediumUnweighted\", \n",
    "         \"deepUnweighted\", \n",
    "         \"shallowWeighted\", \n",
    "         \"mediumWeighted\", \n",
    "         \"deepWeighted\"]) \n",
    "    yield nodeId, nodeProperty, propertyValue\n",
    "    WITH gds.util.asNode(nodeId) as a,\n",
    "    MAX(case when nodeProperty = \"shallowUnweighted\" then       \n",
    "           propertyValue end) as shallowUnweighted,\n",
    "    MAX(case when nodeProperty = \"mediumUnweighted\" then \n",
    "           propertyValue end) as mediumUnweighted,\n",
    "    MAX(case when nodeProperty = \"deepUnweighted\" then \n",
    "           propertyValue end) as deepUnweighted,\n",
    "    MAX(case when nodeProperty = \"shallowWeighted\" then \n",
    "           propertyValue end) as shallowWeighted,\n",
    "    MAX(case when nodeProperty = \"mediumWeighted\" then \n",
    "           propertyValue end) as mediumWeighted,\n",
    "    MAX(case when nodeProperty = \"deepWeighted\" then \n",
    "           propertyValue end) as deepWeighted\n",
    "    MATCH (a)-[:ON_CONTINENT]->(c:Continent)\n",
    "    RETURN\n",
    "    a.descr as airport_name, \n",
    "    a.iata as airport_code, \n",
    "    c.name as continent,\n",
    "    shallowUnweighted,\n",
    "    mediumUnweighted,\n",
    "    deepUnweighted,\n",
    "    shallowWeighted,\n",
    "    mediumWeighted,\n",
    "    deepWeighted\n",
    "    ORDER BY size([(a)-[:HAS_ROUTE]-() | a]) DESC\n",
    "    LIMIT 900\n",
    "    \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "13a7d197",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>airport_name</th>\n",
       "      <th>airport_code</th>\n",
       "      <th>continent</th>\n",
       "      <th>shallowUnweighted</th>\n",
       "      <th>mediumUnweighted</th>\n",
       "      <th>deepUnweighted</th>\n",
       "      <th>shallowWeighted</th>\n",
       "      <th>mediumWeighted</th>\n",
       "      <th>deepWeighted</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Frankfurt am Main</td>\n",
       "      <td>FRA</td>\n",
       "      <td>EU</td>\n",
       "      <td>[-0.07399057596921921, 0.2620871663093567, 0.1...</td>\n",
       "      <td>[-0.11316736042499542, 0.24514061212539673, 0....</td>\n",
       "      <td>[-0.15192122757434845, 0.5060424208641052, 0.2...</td>\n",
       "      <td>[-0.19411295652389526, 0.2675624191761017, 0.2...</td>\n",
       "      <td>[-0.1977788209915161, 0.2508077621459961, 0.13...</td>\n",
       "      <td>[-0.36135566234588623, 0.5160863399505615, 0.3...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Paris Charles de Gaulle</td>\n",
       "      <td>CDG</td>\n",
       "      <td>EU</td>\n",
       "      <td>[-0.06564060598611832, 0.055160876363515854, 0...</td>\n",
       "      <td>[-0.11409448832273483, 0.21923694014549255, 0....</td>\n",
       "      <td>[-0.15566448867321014, 0.28849947452545166, 0....</td>\n",
       "      <td>[-0.15881961584091187, 0.0621316060423851, 0.2...</td>\n",
       "      <td>[-0.20260721445083618, 0.22906702756881714, 0....</td>\n",
       "      <td>[-0.3372170031070709, 0.30104851722717285, 0.3...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Istanbul International Airport</td>\n",
       "      <td>IST</td>\n",
       "      <td>EU</td>\n",
       "      <td>[0.026787318289279938, 0.2438107430934906, 0.1...</td>\n",
       "      <td>[-0.025942979380488396, 0.2735888957977295, 0....</td>\n",
       "      <td>[-0.0012168977409601212, 0.5254808664321899, 0...</td>\n",
       "      <td>[-0.0003005862236022949, 0.26281487941741943, ...</td>\n",
       "      <td>[-0.06701691448688507, 0.2827916741371155, 0.1...</td>\n",
       "      <td>[-0.07971426844596863, 0.5542945861816406, 0.3...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Amsterdam Airport Schiphol</td>\n",
       "      <td>AMS</td>\n",
       "      <td>EU</td>\n",
       "      <td>[-0.1855502426624298, 0.16803550720214844, 0.1...</td>\n",
       "      <td>[-0.16270774602890015, 0.2214188426733017, 0.1...</td>\n",
       "      <td>[-0.297057569026947, 0.40379035472869873, 0.24...</td>\n",
       "      <td>[-0.28153276443481445, 0.19925662875175476, 0....</td>\n",
       "      <td>[-0.2414441704750061, 0.22703152894973755, 0.1...</td>\n",
       "      <td>[-0.47922539710998535, 0.43863940238952637, 0....</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Munich International Airport</td>\n",
       "      <td>MUC</td>\n",
       "      <td>EU</td>\n",
       "      <td>[-0.20580337941646576, 0.11519283056259155, 0....</td>\n",
       "      <td>[-0.16538169980049133, 0.2382025420665741, 0.1...</td>\n",
       "      <td>[-0.3348800837993622, 0.3535888195037842, 0.32...</td>\n",
       "      <td>[-0.29063165187835693, 0.13292333483695984, 0....</td>\n",
       "      <td>[-0.233033686876297, 0.24436715245246887, 0.15...</td>\n",
       "      <td>[-0.4940841495990753, 0.37679851055145264, 0.3...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>895</th>\n",
       "      <td>Nanping Wuyishan Airport</td>\n",
       "      <td>WUS</td>\n",
       "      <td>AS</td>\n",
       "      <td>[-0.15465746819972992, -0.29468223452568054, -...</td>\n",
       "      <td>[-0.16766786575317383, -0.05741892755031586, -...</td>\n",
       "      <td>[-0.28116992115974426, -0.25400516390800476, -...</td>\n",
       "      <td>[-0.16491110622882843, -0.310563325881958, -0....</td>\n",
       "      <td>[-0.19777408242225647, -0.0949367955327034, -0...</td>\n",
       "      <td>[-0.33032694458961487, -0.3239209055900574, -0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>896</th>\n",
       "      <td>Scott AFB/Midamerica Airport</td>\n",
       "      <td>BLV</td>\n",
       "      <td>NA</td>\n",
       "      <td>[0.3646937608718872, 0.18155963718891144, -0.1...</td>\n",
       "      <td>[0.38825953006744385, 0.09397226572036743, -0....</td>\n",
       "      <td>[0.6421867609024048, 0.2155066579580307, -0.12...</td>\n",
       "      <td>[0.3598550856113434, 0.179595947265625, -0.126...</td>\n",
       "      <td>[0.38907772302627563, 0.08189046382904053, -0....</td>\n",
       "      <td>[0.6340279579162598, 0.1816011667251587, -0.09...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>897</th>\n",
       "      <td>Canberra International Airport</td>\n",
       "      <td>CBR</td>\n",
       "      <td>OC</td>\n",
       "      <td>[0.0862639844417572, 0.5978029370307922, 0.028...</td>\n",
       "      <td>[0.18571466207504272, 0.6202242374420166, 0.07...</td>\n",
       "      <td>[0.1772807538509369, 1.2233781814575195, 0.106...</td>\n",
       "      <td>[0.04642222821712494, 0.528540849685669, 0.041...</td>\n",
       "      <td>[0.12939876317977905, 0.6064460277557373, 0.09...</td>\n",
       "      <td>[0.1165374219417572, 1.1702359914779663, 0.154...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>898</th>\n",
       "      <td>Mangalore International Airport</td>\n",
       "      <td>IXE</td>\n",
       "      <td>AS</td>\n",
       "      <td>[0.0036581531167030334, 0.37329620122909546, 0...</td>\n",
       "      <td>[0.11747836321592331, 0.337380051612854, 0.131...</td>\n",
       "      <td>[0.08971487730741501, 0.7435741424560547, 0.12...</td>\n",
       "      <td>[-0.029092632234096527, 0.34626173973083496, 0...</td>\n",
       "      <td>[0.06642842292785645, 0.3237442374229431, 0.11...</td>\n",
       "      <td>[0.023804744705557823, 0.7144446969032288, 0.1...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>899</th>\n",
       "      <td>Cherry Capital Airport</td>\n",
       "      <td>TVC</td>\n",
       "      <td>NA</td>\n",
       "      <td>[0.14239120483398438, 0.07686980068683624, 0.2...</td>\n",
       "      <td>[0.2795731723308563, 0.05664905160665512, 0.08...</td>\n",
       "      <td>[0.36861124634742737, 0.10893549770116806, 0.2...</td>\n",
       "      <td>[0.13504764437675476, 0.0393684059381485, 0.25...</td>\n",
       "      <td>[0.26504385471343994, 0.01004377193748951, 0.1...</td>\n",
       "      <td>[0.35544389486312866, 0.029853176325559616, 0....</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>900 rows × 9 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                        airport_name airport_code continent  \\\n",
       "0                  Frankfurt am Main          FRA        EU   \n",
       "1            Paris Charles de Gaulle          CDG        EU   \n",
       "2     Istanbul International Airport          IST        EU   \n",
       "3         Amsterdam Airport Schiphol          AMS        EU   \n",
       "4       Munich International Airport          MUC        EU   \n",
       "..                               ...          ...       ...   \n",
       "895         Nanping Wuyishan Airport          WUS        AS   \n",
       "896     Scott AFB/Midamerica Airport          BLV        NA   \n",
       "897   Canberra International Airport          CBR        OC   \n",
       "898  Mangalore International Airport          IXE        AS   \n",
       "899           Cherry Capital Airport          TVC        NA   \n",
       "\n",
       "                                     shallowUnweighted  \\\n",
       "0    [-0.07399057596921921, 0.2620871663093567, 0.1...   \n",
       "1    [-0.06564060598611832, 0.055160876363515854, 0...   \n",
       "2    [0.026787318289279938, 0.2438107430934906, 0.1...   \n",
       "3    [-0.1855502426624298, 0.16803550720214844, 0.1...   \n",
       "4    [-0.20580337941646576, 0.11519283056259155, 0....   \n",
       "..                                                 ...   \n",
       "895  [-0.15465746819972992, -0.29468223452568054, -...   \n",
       "896  [0.3646937608718872, 0.18155963718891144, -0.1...   \n",
       "897  [0.0862639844417572, 0.5978029370307922, 0.028...   \n",
       "898  [0.0036581531167030334, 0.37329620122909546, 0...   \n",
       "899  [0.14239120483398438, 0.07686980068683624, 0.2...   \n",
       "\n",
       "                                      mediumUnweighted  \\\n",
       "0    [-0.11316736042499542, 0.24514061212539673, 0....   \n",
       "1    [-0.11409448832273483, 0.21923694014549255, 0....   \n",
       "2    [-0.025942979380488396, 0.2735888957977295, 0....   \n",
       "3    [-0.16270774602890015, 0.2214188426733017, 0.1...   \n",
       "4    [-0.16538169980049133, 0.2382025420665741, 0.1...   \n",
       "..                                                 ...   \n",
       "895  [-0.16766786575317383, -0.05741892755031586, -...   \n",
       "896  [0.38825953006744385, 0.09397226572036743, -0....   \n",
       "897  [0.18571466207504272, 0.6202242374420166, 0.07...   \n",
       "898  [0.11747836321592331, 0.337380051612854, 0.131...   \n",
       "899  [0.2795731723308563, 0.05664905160665512, 0.08...   \n",
       "\n",
       "                                        deepUnweighted  \\\n",
       "0    [-0.15192122757434845, 0.5060424208641052, 0.2...   \n",
       "1    [-0.15566448867321014, 0.28849947452545166, 0....   \n",
       "2    [-0.0012168977409601212, 0.5254808664321899, 0...   \n",
       "3    [-0.297057569026947, 0.40379035472869873, 0.24...   \n",
       "4    [-0.3348800837993622, 0.3535888195037842, 0.32...   \n",
       "..                                                 ...   \n",
       "895  [-0.28116992115974426, -0.25400516390800476, -...   \n",
       "896  [0.6421867609024048, 0.2155066579580307, -0.12...   \n",
       "897  [0.1772807538509369, 1.2233781814575195, 0.106...   \n",
       "898  [0.08971487730741501, 0.7435741424560547, 0.12...   \n",
       "899  [0.36861124634742737, 0.10893549770116806, 0.2...   \n",
       "\n",
       "                                       shallowWeighted  \\\n",
       "0    [-0.19411295652389526, 0.2675624191761017, 0.2...   \n",
       "1    [-0.15881961584091187, 0.0621316060423851, 0.2...   \n",
       "2    [-0.0003005862236022949, 0.26281487941741943, ...   \n",
       "3    [-0.28153276443481445, 0.19925662875175476, 0....   \n",
       "4    [-0.29063165187835693, 0.13292333483695984, 0....   \n",
       "..                                                 ...   \n",
       "895  [-0.16491110622882843, -0.310563325881958, -0....   \n",
       "896  [0.3598550856113434, 0.179595947265625, -0.126...   \n",
       "897  [0.04642222821712494, 0.528540849685669, 0.041...   \n",
       "898  [-0.029092632234096527, 0.34626173973083496, 0...   \n",
       "899  [0.13504764437675476, 0.0393684059381485, 0.25...   \n",
       "\n",
       "                                        mediumWeighted  \\\n",
       "0    [-0.1977788209915161, 0.2508077621459961, 0.13...   \n",
       "1    [-0.20260721445083618, 0.22906702756881714, 0....   \n",
       "2    [-0.06701691448688507, 0.2827916741371155, 0.1...   \n",
       "3    [-0.2414441704750061, 0.22703152894973755, 0.1...   \n",
       "4    [-0.233033686876297, 0.24436715245246887, 0.15...   \n",
       "..                                                 ...   \n",
       "895  [-0.19777408242225647, -0.0949367955327034, -0...   \n",
       "896  [0.38907772302627563, 0.08189046382904053, -0....   \n",
       "897  [0.12939876317977905, 0.6064460277557373, 0.09...   \n",
       "898  [0.06642842292785645, 0.3237442374229431, 0.11...   \n",
       "899  [0.26504385471343994, 0.01004377193748951, 0.1...   \n",
       "\n",
       "                                          deepWeighted  \n",
       "0    [-0.36135566234588623, 0.5160863399505615, 0.3...  \n",
       "1    [-0.3372170031070709, 0.30104851722717285, 0.3...  \n",
       "2    [-0.07971426844596863, 0.5542945861816406, 0.3...  \n",
       "3    [-0.47922539710998535, 0.43863940238952637, 0....  \n",
       "4    [-0.4940841495990753, 0.37679851055145264, 0.3...  \n",
       "..                                                 ...  \n",
       "895  [-0.33032694458961487, -0.3239209055900574, -0...  \n",
       "896  [0.6340279579162598, 0.1816011667251587, -0.09...  \n",
       "897  [0.1165374219417572, 1.1702359914779663, 0.154...  \n",
       "898  [0.023804744705557823, 0.7144446969032288, 0.1...  \n",
       "899  [0.35544389486312866, 0.029853176325559616, 0....  \n",
       "\n",
       "[900 rows x 9 columns]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "embedding_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "0ef8267a",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_emblaze_embedding(embedding_df, column):\n",
    "    emb = emblaze.Embedding({\n",
    "             emblaze.Field.POSITION: np.array(list(embedding_df[column])),\n",
    "             emblaze.Field.COLOR: embedding_df['continent']}, \n",
    "             n_neighbors = 10,\n",
    "             label=column, \n",
    "             metric='cosine')\n",
    "    emb.compute_neighbors()\n",
    "    return emb.project()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "61520bf7",
   "metadata": {},
   "outputs": [],
   "source": [
    "emblaze_embeddings = [create_emblaze_embedding(embedding_df, column)    \n",
    "   for column in embedding_df.columns[3:]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "4739a20e",
   "metadata": {},
   "outputs": [],
   "source": [
    "variants = emblaze.EmbeddingSet(emblaze_embeddings)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "ffa3c6e5-a253-4e22-9775-c0ed16991421",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<EmbeddingSet with 6 embeddings:\n",
       "\t<Embedding with 900 items, 2 fields (position, color)>\n",
       "\t<Embedding with 900 items, 2 fields (position, color)>\n",
       "\t<Embedding with 900 items, 2 fields (position, color)>\n",
       "\t<Embedding with 900 items, 2 fields (position, color)>\n",
       "\t<Embedding with 900 items, 2 fields (position, color)>\n",
       "\t<Embedding with 900 items, 2 fields (position, color)>>"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "variants"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "ead84947",
   "metadata": {},
   "outputs": [],
   "source": [
    "thumbnails = emblaze.TextThumbnails(embedding_df['airport_name'] + \n",
    "   \" (\" + embedding_df['airport_code'] + \")\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "4c51c2b2",
   "metadata": {},
   "outputs": [],
   "source": [
    "w = emblaze.Viewer(embeddings = variants, thumbnails = thumbnails)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "22db3a07",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "115f8e04e76840ec851a1d663565ca6d",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Viewer(colorScheme='tableau', data={'data': [{'_format': 'compressed', '_idtype': 'u2', '_length': 900, 'ids':…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "w"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "5002213d-0ba8-44d1-8634-b0a41623a144",
   "metadata": {},
   "outputs": [],
   "source": [
    "rout = gds.run_cypher(\"\"\"\n",
    "MATCH p=shortestPath((p1:Airport {icao:'KMSP'})-[:HAS_ROUTE*1..20]->(p3:Airport {icao:'NZWN'})) \\\n",
    "Return nodes(p) as path\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "c456c71d-1c9f-412d-8551-400f0527fe12",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>path</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[(altitude, componentId, longest, city, latitu...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                path\n",
       "0  [(altitude, componentId, longest, city, latitu..."
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rout"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "c718fc56-dc66-403a-9719-bd4445b4dfc1",
   "metadata": {},
   "outputs": [],
   "source": [
    "def dijkstra_distance(source, destination):\n",
    "    return gds.run_cypher(\"\"\"\n",
    "MATCH (p1:Airport {iata:'\"\"\" + source +\"\"\"'}), (p2:Airport {iata:'\"\"\" + destination + \"\"\"'})\n",
    "\n",
    "CALL gds.shortestPath.dijkstra.stream('air-routes',{\n",
    "    sourceNode: p1,\n",
    "    targetNode: p2,\n",
    "    relationshipWeightProperty: 'distance'\n",
    "})\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    index,\n",
    "    gds.util.asNode(sourceNode).city AS sourceNodeName,\n",
    "    gds.util.asNode(targetNode).city AS targetNodeName,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).city] AS nodeNames,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).iata] AS nodeIATA,\n",
    "    costs,\n",
    "    nodes(path) as path\n",
    "ORDER BY index\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "2eb994bf-5737-496c-82c3-ae02f78a15a6",
   "metadata": {},
   "outputs": [],
   "source": [
    "def astar_distance(source, destination):\n",
    "    return gds.run_cypher(\"\"\"\n",
    "MATCH (p1:Airport {iata:'\"\"\" + source + \"\"\"'}), (p2:Airport {iata:'\"\"\" + destination + \"\"\"'})\n",
    "\n",
    "CALL gds.shortestPath.astar.stream('air-routes',{\n",
    "    sourceNode: p1,\n",
    "    targetNode: p2,\n",
    "    latitudeProperty: 'latitude',\n",
    "    longitudeProperty: 'longitude',\n",
    "    relationshipWeightProperty: 'distance'\n",
    "})\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    index,\n",
    "    gds.util.asNode(sourceNode).city AS sourceNodeName,\n",
    "    gds.util.asNode(targetNode).city AS targetNodeName,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).city] AS nodeNames,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).iata] AS nodeIATA,\n",
    "    costs,\n",
    "    nodes(path) as path\n",
    "ORDER BY index\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "bd1620f0-5eb8-4fba-946f-1822d5bc4b8b",
   "metadata": {},
   "outputs": [],
   "source": [
    "def dijkstra_rank(source, destination):\n",
    "    return gds.run_cypher(\"\"\"\n",
    "MATCH (p1:Airport {iata:'\"\"\" + source + \"\"\"'}), (p2:Airport {iata:'\"\"\" + destination + \"\"\"'})\n",
    "\n",
    "CALL gds.shortestPath.dijkstra.stream('air-routes',{\n",
    "    sourceNode: p1,\n",
    "    targetNode: p2,\n",
    "    relationshipWeightProperty: 'weightedRank'\n",
    "})\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    index,\n",
    "    gds.util.asNode(sourceNode).city AS sourceNodeName,\n",
    "    gds.util.asNode(targetNode).city AS targetNodeName,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).city] AS nodeNames,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).iata] AS nodeIATA,\n",
    "    costs,\n",
    "    nodes(path) as path\n",
    "ORDER BY index\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "83afc2eb-1126-4f1c-ba2f-5cbdcc286c48",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>sourceNodeName</th>\n",
       "      <th>targetNodeName</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodeNames</th>\n",
       "      <th>nodeIATA</th>\n",
       "      <th>costs</th>\n",
       "      <th>path</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>New Delhi</td>\n",
       "      <td>White Plains</td>\n",
       "      <td>7309.0</td>\n",
       "      <td>[New Delhi, Reykjavik, Boston, White Plains]</td>\n",
       "      <td>[DEL, KEF, BOS, HPN]</td>\n",
       "      <td>[0.0, 4737.0, 7143.0, 7309.0]</td>\n",
       "      <td>[(altitude, longest, componentId, city, latitu...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   index sourceNodeName targetNodeName  totalCost  \\\n",
       "0      0      New Delhi   White Plains     7309.0   \n",
       "\n",
       "                                      nodeNames              nodeIATA  \\\n",
       "0  [New Delhi, Reykjavik, Boston, White Plains]  [DEL, KEF, BOS, HPN]   \n",
       "\n",
       "                           costs  \\\n",
       "0  [0.0, 4737.0, 7143.0, 7309.0]   \n",
       "\n",
       "                                                path  \n",
       "0  [(altitude, longest, componentId, city, latitu...  "
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dijkstra_distance(\"DEL\", \"HPN\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "c80ab325-5b70-44ae-98e1-09aeeb673cb5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>sourceNodeName</th>\n",
       "      <th>targetNodeName</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodeNames</th>\n",
       "      <th>nodeIATA</th>\n",
       "      <th>costs</th>\n",
       "      <th>path</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>New Delhi</td>\n",
       "      <td>White Plains</td>\n",
       "      <td>7309.0</td>\n",
       "      <td>[New Delhi, Reykjavik, Boston, White Plains]</td>\n",
       "      <td>[DEL, KEF, BOS, HPN]</td>\n",
       "      <td>[0.0, 4737.0, 7143.0, 7309.0]</td>\n",
       "      <td>[(altitude, longest, componentId, city, latitu...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   index sourceNodeName targetNodeName  totalCost  \\\n",
       "0      0      New Delhi   White Plains     7309.0   \n",
       "\n",
       "                                      nodeNames              nodeIATA  \\\n",
       "0  [New Delhi, Reykjavik, Boston, White Plains]  [DEL, KEF, BOS, HPN]   \n",
       "\n",
       "                           costs  \\\n",
       "0  [0.0, 4737.0, 7143.0, 7309.0]   \n",
       "\n",
       "                                                path  \n",
       "0  [(altitude, longest, componentId, city, latitu...  "
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "astar_distance(\"DEL\", \"HPN\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "ccff9fd2-4833-41b6-ad8b-1a6eb9577f9d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>sourceNodeName</th>\n",
       "      <th>targetNodeName</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodeNames</th>\n",
       "      <th>nodeIATA</th>\n",
       "      <th>costs</th>\n",
       "      <th>path</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>New Delhi</td>\n",
       "      <td>White Plains</td>\n",
       "      <td>20.671068</td>\n",
       "      <td>[New Delhi, Chicago, White Plains]</td>\n",
       "      <td>[DEL, ORD, HPN]</td>\n",
       "      <td>[0.0, 8.620578713845259, 20.671068093627866]</td>\n",
       "      <td>[(altitude, longest, componentId, city, latitu...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   index sourceNodeName targetNodeName  totalCost  \\\n",
       "0      0      New Delhi   White Plains  20.671068   \n",
       "\n",
       "                            nodeNames         nodeIATA  \\\n",
       "0  [New Delhi, Chicago, White Plains]  [DEL, ORD, HPN]   \n",
       "\n",
       "                                          costs  \\\n",
       "0  [0.0, 8.620578713845259, 20.671068093627866]   \n",
       "\n",
       "                                                path  \n",
       "0  [(altitude, longest, componentId, city, latitu...  "
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dijkstra_rank(\"DEL\", \"HPN\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "44f874fc-056b-41af-8f90-ff2341243cf8",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "bf226cb7-9136-4a47-9d4b-5d45c8ae8096",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "graphName                                           connected-airports\n",
       "database                                                         neo4j\n",
       "memoryUsage                                                           \n",
       "sizeInBytes                                                         -1\n",
       "nodeCount                                                         3292\n",
       "relationshipCount                                                49476\n",
       "configuration        {'creationTime': 2022-12-07T10:21:21.247190000...\n",
       "density                                                       0.004567\n",
       "creationTime                       2022-12-07T10:21:21.247190000+05:30\n",
       "modificationTime                   2022-12-07T10:21:21.393133000+05:30\n",
       "schema               {'relationships': {'HAS_ROUTE': {'distance': '...\n",
       "Name: 0, dtype: object"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "G_routes.drop()\n",
    "G_connected_airports.drop()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e93a1b78-c84a-41ad-bb75-eeed31e87427",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.15"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
